In [1]:
import pandas as pd
employees = pd.read_csv("employees.csv")
employees

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

In [2]:
employees["bonus"] = 0
condition = (employees['employee_id'] % 2 == 1) & (~employees['name'].str.startswith('M'))
employees.loc[condition, 'bonus'] = employees['salary']
employees[["employee_id", "bonus"]]

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700

### Another solution

In [3]:
employees = pd.read_csv("employees.csv")
def calculate_bonus(row):
    if row["employee_id"] % 2 == 1 and not row["name"].startswith("M"):
        return row["salary"]
    else:
        return 0

employees["bonus"] = employees.apply(calculate_bonus, axis=1)
employees[["employee_id", "bonus"]]

   employee_id  bonus
0            2      0
1            3      0
2            7   7400
3            8      0
4            9   7700